using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.ComponentModel.DataAnnotations;
using System.Text;

namespace ProductLibrary
{
    public enum Cities
    {
        [Display(Name = "Айтос")]
        Айтос,

        [Display(Name = "Аксаково")]
        Аксаково,

        [Display(Name = "Алфатар")]
        Алфатар,

        [Display(Name = "Антоново")]
        Антоново,

        [Display(Name = "Априлци")]
        Априлци,

        [Display(Name = "Ардино")]
        Ардино,

        [Display(Name = "Асеновград")]
        Асеновград,

        [Display(Name = "Ахелой")]
        Ахелой,

        Ахтопол,

        Балчик,

        Банкя,

        Банско,

        Баня,

        Батак,

        Батановци,

        Белене,

        Белица,

        Белово,

        Белоградчик,

        Белослав,

        Берковица,

        Благоевград,
        [Display(Name = "Бобов дол")]
        Бобовдол,

        Бобошево,

        Божурище,

        Бойчиновци,

        Болярово,

        Борово,

        Ботевград,

        Брацигово,

        Брегово,

        Брезник,

        Брезово,

        Брусарци,

        Бургас,

        Бухово,

        Българово,

        [Display(Name = "Бяла(област Варна)")]
        БялаобластВарна,

        [Display(Name = "Бяла(област Русе)")]
        Бялаобласт,

        [Display(Name = "Бяла Слатина")]
        БялаСлатина,

        [Display(Name = "Бяла черква")]
        Бялачерква,

        Варна,

        [Display(Name = "Велики Преслав")]
        ВеликиПреслав,

        [Display(Name = "Велико Търново")]
        ВеликоТърново,

        Велинград,

        Ветово,

        Ветрен,

        Видин,

        Враца,

        Вълчедръм,

        Вълчидол,

        Върбица,

        Вършец,

        Габрово,

        [Display(Name = "Генерал Тошево")]
        ГенералТошево,

        Главиница,

        Глоджево,

        Годеч,

        [Display(Name = "Горна Оряховица")]
        ГорнаОряховица,

        [Display(Name = "Гоце Делчев")]
        ГоцеДелчев,

        Грамада,

        Гулянци,

        Гурково,

        Гълъбово,

        [Display(Name = "Две могили")]
        Двемогили,

        Дебелец,

        Девин,

        Девня,

        Джебел,

        Димитровград,

        Димово,

        Добринище,

        Добрич,

        [Display(Name = "Долна баня")]
        Долнабаня,

        [Display(Name = "Долна Митрополия")]
        ДолнаМитрополия,

        [Display(Name = "Долна Оряховица")]
        ДолнаОряховица,

        [Display(Name = "Долни Дъбник")]
        ДолниДъбник,

        [Display(Name = "Долни чифлик")]
        Долничифлик,

        Доспат,

        Драгоман,

        Дряново,

        Дулово,

        Дунавци,

        Дупница,

        Дългопол,

        Елена,

        [Display(Name = "Елин Пелин")]
        ЕлинПелин,

        Елхово,

        Етрополе,

        Завет,

        Земен,

        Златарица,

        Златица,

        Златоград,

        Ивайловград‎,

        Игнатиево,

        Искър,

        Исперих,

        Ихтиман,

        Каблешково,

        Каварна,

        Казанлък,

        Калофер,

        Камено,

        Каолиново,

        Карлово,

        Карнобат,

        Каспичан,

        Кермен,

        Килифарево,

        Китен,

        Клисура,

        Кнежа,

        Козлодуй,

        Койнаре,

        Копривщица,

        Костандово,

        Костенец,

        Костинброд,

        Котел,

        Кочериново,

        Кресна,

        Криводол,

        Кричим,

        Крумовград,

        Крън,

        Кубрат,

        Куклен,

        Кула,

        Кърджали,

        Кюстендил,

        Левски,

        Летница,

        Ловеч,

        Лозница,

        Лом,

        Луковит,

        Лъки,

        Любимец,

        Лясковец,

        Мадан,

        Маджарово,

        [Display(Name = "Малко Търново")]
        МалкоТърново,

        Мартен,

        Мездра,

        Мелник,

        Меричлери,

        Мизия,

        [Display(Name = "Момин проход")]
        Моминпроход,

        Момчилград,

        Монтана,

        Мъглиж,

        Неделино,

        Несебър,

        Николаево,

        Никопол,

        [Display(Name = "Нова Загора")]
        НоваЗагора,

        [Display(Name = "Нови Искър")]
        НовиИскър,

        [Display(Name = "Нови пазар")]
        Новипазар,

        Обзор,

        Омуртаг,

        Опака,

        Оряхово,

        [Display(Name = "Павел баня")]
        Павелбаня,

        Павликени,

        Пазарджик,

        Панагюрище,

        Перник,

        Перущица,

        Петрич,

        Пещера,

        Пирдоп,

        Плачковци,

        Плевен,

        Плиска,

        Пловдив,

        [Display(Name = "Полски Тръмбеш")]
        ПолскиТръмбеш,

        Поморие,

        Попово,

        Пордим,

        Правец,

        Приморско,

        Провадия,

        Първомай,

        Раднево,

        Радомир,

        Разград,

        Разлог,

        Ракитово,

        Раковски,

        Рила,

        Роман,

        Рудозем,

        Русе,

        Садово,

        Самоков,

        Сандански,

        [Display(Name = "Сапарева баня")]
        Сапаревабаня,

        [Display(Name = "Свети Влас")]
        СветиВлас,

        Свиленград,

        Свищов,

        Своге,

        Севлиево,

        Сеново,

        Септември,

        Силистра,

        Симеоновград,

        Симитли,

        Славяново,

        Сливен,

        Сливница,

        [Display(Name = "Сливо поле")]
        Сливополе,

        Смолян,

        Смядово,

        Созопол,

        Сопот,

        София,

        Средец,

        Стамболийски,

        [Display(Name = "Стара Загора")]
        СтараЗагора,

        Стражица,

        Стралджа,

        Стрелча,

        Суворово,

        Сунгурларе,

        Сухиндол,

        Съединение,

        Сърница,

        Твърдица,

        Тервел,

        Тетевен,

        Тополовград,

        Троян,

        Трън,

        Тръстеник,

        Трявна,

        Тутракан,

        Търговище,

        Угърчин,

        Хаджидимово,

        Харманли,

        Хасково,

        Хисаря,

        [Display(Name = "Цар Калоян")]
        ЦарКалоян,

        Царево,

        Чепеларе,

        [Display(Name = "Червен бряг")]
        Червенбряг,

        Черноморец,

        Чипровци,

        Чирпан,

        Шабла,

        Шивачево,

        Шипка,

        Шумен,

        Ябланица,

        Якоруда,

        Ямбол



































































    }
}
